In [9]:
import pandas as pd
import numpy as np

In [6]:
dates = pd.date_range('1/1/2000', periods=8)

In [11]:
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2000-01-01 -1.687007  1.231240 -0.623429  0.999603
2000-01-02 -0.084681 -0.827395 -1.561128 -0.054615
2000-01-03 -0.693068  0.578809  0.984821 -0.119186
2000-01-04  1.630269 -0.288086  0.053160 -0.211030
2000-01-05 -2.029942  1.218972 -0.090804 -0.079280
2000-01-06 -0.720126 -0.143808  0.684688  0.522140
2000-01-07 -0.799912 -1.016624  0.524848 -0.024338
2000-01-08  1.359086 -0.078591 -0.041180  0.086708

In [15]:
panel = pd.Panel({'one' : df, 'two' : df - df.mean()})
panel

<class 'pandas.core.panel.Panel'>
Dimensions: 2 (items) x 8 (major_axis) x 4 (minor_axis)
Items axis: one to two
Major_axis axis: 2000-01-01 00:00:00 to 2000-01-08 00:00:00
Minor_axis axis: A to D

In [18]:
s = df['A']
s[dates[0]]

-1.6870072350985692

In [19]:
s[dates[5]]

-0.7201258106662564

In [21]:
panel['one']

                   A         B         C         D
2000-01-01 -1.687007  1.231240 -0.623429  0.999603
2000-01-02 -0.084681 -0.827395 -1.561128 -0.054615
2000-01-03 -0.693068  0.578809  0.984821 -0.119186
2000-01-04  1.630269 -0.288086  0.053160 -0.211030
2000-01-05 -2.029942  1.218972 -0.090804 -0.079280
2000-01-06 -0.720126 -0.143808  0.684688  0.522140
2000-01-07 -0.799912 -1.016624  0.524848 -0.024338
2000-01-08  1.359086 -0.078591 -0.041180  0.086708

In [22]:
panel['two']

                   A         B         C         D
2000-01-01 -1.308835  1.146926 -0.614801  0.859602
2000-01-02  0.293491 -0.911709 -1.552500 -0.194615
2000-01-03 -0.314895  0.494494  0.993449 -0.259186
2000-01-04  2.008442 -0.372400  0.061788 -0.351030
2000-01-05 -1.651769  1.134657 -0.082176 -0.219280
2000-01-06 -0.341953 -0.228123  0.693316  0.382139
2000-01-07 -0.421740 -1.100938  0.533476 -0.164339
2000-01-08  1.737258 -0.162906 -0.032552 -0.053292

In [30]:
df[['A', 'B']] = df[['B', 'A']]
df

                   A         B         C         D
2000-01-01 -1.687007  1.231240 -0.623429  0.999603
2000-01-02 -0.084681 -0.827395 -1.561128 -0.054615
2000-01-03 -0.693068  0.578809  0.984821 -0.119186
2000-01-04  1.630269 -0.288086  0.053160 -0.211030
2000-01-05 -2.029942  1.218972 -0.090804 -0.079280
2000-01-06 -0.720126 -0.143808  0.684688  0.522140
2000-01-07 -0.799912 -1.016624  0.524848 -0.024338
2000-01-08  1.359086 -0.078591 -0.041180  0.086708

In [31]:
df[['B', 'A']] = df[['A', 'B']]
df

                   A         B         C         D
2000-01-01  1.231240 -1.687007 -0.623429  0.999603
2000-01-02 -0.827395 -0.084681 -1.561128 -0.054615
2000-01-03  0.578809 -0.693068  0.984821 -0.119186
2000-01-04 -0.288086  1.630269  0.053160 -0.211030
2000-01-05  1.218972 -2.029942 -0.090804 -0.079280
2000-01-06 -0.143808 -0.720126  0.684688  0.522140
2000-01-07 -1.016624 -0.799912  0.524848 -0.024338
2000-01-08 -0.078591  1.359086 -0.041180  0.086708

In [4]:
sa = pd.Series([1,2,3],index=list('abc'))
sa

a    1
b    2
c    3
dtype: int64

In [32]:
dfa = df.copy()

In [33]:
sa.b

2

In [34]:
dfa.A

2000-01-01    1.231240
2000-01-02   -0.827395
2000-01-03    0.578809
2000-01-04   -0.288086
2000-01-05    1.218972
2000-01-06   -0.143808
2000-01-07   -1.016624
2000-01-08   -0.078591
Freq: D, Name: A, dtype: float64

In [35]:
panel.one

                   A         B         C         D
2000-01-01 -1.687007  1.231240 -0.623429  0.999603
2000-01-02 -0.084681 -0.827395 -1.561128 -0.054615
2000-01-03 -0.693068  0.578809  0.984821 -0.119186
2000-01-04  1.630269 -0.288086  0.053160 -0.211030
2000-01-05 -2.029942  1.218972 -0.090804 -0.079280
2000-01-06 -0.720126 -0.143808  0.684688  0.522140
2000-01-07 -0.799912 -1.016624  0.524848 -0.024338
2000-01-08  1.359086 -0.078591 -0.041180  0.086708

In [36]:
sa.a = 5

In [37]:
sa

a    5
b    2
c    3
dtype: int64

In [39]:
dfa.A = list(range(len(dfa.index)))
dfa.A

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
2000-01-08    7
Freq: D, Name: A, dtype: int64

In [44]:
x = pd.DataFrame({'x': [1, 2, 3], 'y': [3, 4, 5]})
x

   x  y
0  1  3
1  2  4
2  3  5

In [47]:
# Replacing 2 and 4 with 9 and 99
x.iloc[1] = dict(x=9, y=99)
x

   x   y
0  1   3
1  9  99
2  3   5

In [50]:
# Can only use attribute access df.two to modify an existing element of a series- but can't use it to create a new column
df = pd.DataFrame({'one': [1., 2., 3.]})
df.two = [4, 5, 6]
df

/usr/local/lib/python3.6/site-packages/ipykernel_launcher.py:2: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access

   one
0  1.0
1  2.0
2  3.0